/**
 * Практически все сущности в JavaScrpit - объект
 * 
 * Объект - набор свойств "Имя: значение";
 * 
 * Пример объекта 
 * {
 *  visible: true, //ключ - visible, true - значение
 *  colorDepth: 24,
 *  title: "My Image"
 *  orientation: { //это вложенный объект, то есть его свойства объект
 *    angle: 0,
 *    type: 'landscape'
 *  },
 * } //это всё свойства объекта
 * 
 * console.log('Hello World')
 * 
 * console - объект 
 * log - метод
 * . - точечная запись, с помощью её можно получить доступ к свойствам объектам
 * () - вызов метода
 * 'Hello world' - значение типа "String"
 * 
 * .dir() - с помощью этого метода можно отобразить в консоли все свойства того или иного объекта
 * .table() - все свойства объекта будут отображенны в виде таблицы
 * 
 * 
 * Выражения 
 * Результатом каждого выражения явлется значение
 * 
 * Выражение с побочными действиями - не только возвращает значение, но и выполняет другие действия (присваивание, изменение значение)
 * 
 */
